[
  "(CANCELADA) Zodac. Masterverse Vintage Collection. Masters of the Universe",
  "(OUTLET) Teela. Masters of the Universe: New Eternia. Masterverse",
  "Anti-Eternia He-Man. Masters of the Universe: New Eternia. Masterverse",
  "April O’Neil. MOTU x TMNT: Turtles of Grayskull",
  "Barbarian Skeletor. Masterverse. Masters of the Universe Revelation",
  "Battle for Eternia. Masters of the Universe Origins",
  "Beast Man -Deluxe- (Cartoon Collection). Masters of the Universe Origins",
  "Beast Man Latex Mask. Masters of the Universe",
  "Beast Man. BDS Art Scale Statue 1/10. Masters of the Universe",
  "Beast Man. Masters of the Universe: New Eternia. Masterverse",
  "Bow (Cartoon Collection). Masters of the Universe Origins",
  "Bumblebee Armor Man-At-Arms. Masters of the Universe x Transformers",
  "Buzz-Off (Cartoon Collection). Masters of the Universe Origins",
  "Casey Jones. MOTU x TMNT: Turtles of Grayskull",
  "Catra (Cartoon Collection). Masters of the Universe Origins.",
  "Cheetara. MOTU x Thundercats",
  "Clamp Champ. MOTU x TMNT: Turtles of Grayskull",
  "Clawful (Cartoon Collection). Masters of the Universe Origins",
  "Deluxe Dragon Blaster Skeletor. Masters of the Universe Origins",
  "Deluxe Lion-O. MOTU x Thundercats",
  "Deluxe Movie He-Man. Masters of the Universe Revelation. Masterverse",
  "Deluxe Slush Head. The New Adventures of He-Man Masterverse",
  "Deluxe Super Shredder. MOTU x TMNT: Turtles of Grayskull",
  "Donatello. MOTU x TMNT: Turtles of Grayskull",
  "Emperor Hordak. Masters of the Universe: Revolution. Masterverse",
  "Evil Horde Leech. Masters of the Universe: She-Ra: Princess of Power. Masterverse",
  "Evil-Lyn (Cartoon Collection). Masters of the Universe Origins",
  "Evil-Lyn. Masters of the Universe Origins",
  "Faker (Cartoon Collection). Masters of the Universe Origins",
  "Faker (Vintage Collection). Masters of the Universe. Masterverse",
  "Fang Man (Cartoon). Masters of the Universe Origins",
  "Flying Fist He-Man. Masters of the Universe: New Eternia. Masterverse",
  "Frosta (Cartoon Collection). Masters of the Universe Origins",
  "Grizzlor (Cartoon). Masters of the Universe Origins",
  "He-Man (Cartoon Collection). Masters of the Universe Origins.",
  "He-Man (Comic Deco). POP! Television. Masters of the Universe",
  "He-Man -MOTU200X- 1/12. Masters of the Universe",
  "He-Man 1/6. Masters of the Universe.",
  "He-Man Unleashed. Deluxe Art Scale 1/10. Masters of the Universe",
  "He-Man and Skeletor 2-Set 80 Anniversary. Origins. Masters of the Universe",
  "He-Man. MOTU x Thundercats",
  "He-Man. Masters of the Universe POP! Animation Vinyl",
  "Hordak & Hellfire-Man. Masters of the Universe x Stranger Things. Mattel",
  "Hordak. MOTU x TMNT: Turtles of Grayskull",
  "Hordak. Masters of the Universe: New Eternia. Masterverse",
  "Invisible Skeletor (Cartoon Collection). Masters of the Universe Origins",
  "King Hiss. MOTU x TMNT: Turtles of Grayskull",
  "King Randor (Cartoon Collection). Masters of the Universe Origins",
  "Kobra Khan. Masters of the Universe: New Eternia. Masterverse",
  "Leatherhead Deluxe. MOTU x TMNT: Turtles of Grayskull",
  "Leonardo. MOTU x TMNT: Turtles of Grayskull.",
  "Man O' War Duncan. Masters of the Universe: New Eternia. Masterverse",
  "Man-At-Arms (Cartoon Collection). Masters of the Universe Origins",
  "Man-At-Arms (Cartoon Collection). Masters of the Universe Origins.",
  "Man-At-Arms (Vintage Collection). Masters of the Universe. Masterverse",
  "Man-E-Faces (Cartoon Collection). Masters of the Universe Origins",
  "Mantenna. Masters of the Universe: New Eternia. Masterverse",
  "Masters of The Universe: Fields of Eternia",
  "Masters of the Universe POP! Scareglow & Nyte-Mare. Rides Vinyl. Funko",
  "Masters of the Unverse Case Protectors (10 uds)",
  "Megatron Armor Skeletor. Masters of the Universe x Transformers",
  "Mekaneck. MOTU x TMNT: Turtles of Grayskull",
  "Mer-Man. Masters of the Universe Revelation",
  "Michelangelo. MOTU x TMNT: Turtles of Grayskull",
  "Michelangelo. MOTU x TMNT: Turtles of Grayskull.",
  "Mini Réplica Palo Ra de Teela. Masters of the Universe.",
  "Mini-Comic Trap Jaw. Masters of the Universe Origins",
  "Mini-Comic Trap Jaw. Masters of the Universe Origins.",
  "Mosquitor. Masters of the Universe: New Eternia. Masterverse",
  "Moss Man (Cartoon Collection). Masters of the Universe Origins",
  "Mutated Ninjor. MOTU x TMNT: Turtles of Grayskull",
  "Orko (Cartoon). Masters of the Universe Origins.",
  "Orko (Comic Deco). POP! Television. Masters of the Universe",
  "Panthro. MOTU x Thundercats",
  "Power Sword Larp Stunt Réplica 1/1. Masters of the Universe",
  "Princess of Power: She-Ra. Masters of the Universe Origins.",
  "Queen Marlena (Cartoon Collection). Masters of the Universe Origins",
  "Ram Man (Cartoon Collection). Masters of the Universe Origins",
  "Raphael. MOTU x TMNT: Turtles of Grayskull",
  "Rattlor. MOTU x TMNT: Turtles of Grayskull",
  "Roboto. Masters of the Universe: New Eternia. Masterverse",
  "She-Ra & Kowl (She-Ra Princes of Power). Funko",
  "She-Ra. Masters of the Universe: New Eterhia. Masterverse",
  "Skelegod Revelation. Masters of the Universe",
  "Skeletor & Throne. Masters of the Universe: New Eternia Masterverse",
  "Skeletor (Classic). Masters of the Universe Origins",
  "Skeletor (Comic Deco). POP! Television. Masters of the Universe",
  "Skeletor -10th Anniversary Ver.-. Prime Scale 1/3. Masters of the Universe",
  "Skeletor 1/6. Masters of the Universe",
  "Skeletor Unleashed. Art Scale 1/10. Masters of the Universe.",
  "Skeletor. MOTU x TMNT: Turtles of Grayskull",
  "Skeletor. Meme POP! TV Vinyl",
  "Sketchbook Series: He-Man. Masters of the Universe Origins. Mattel",
  "Sketchbook Series: Sy-Klone. Masters of the Universe Origins",
  "Snake Armor He-Man. Masters of the Universe Origins",
  "Spikor (Cartoon Collection). Masters of the Universe Origins",
  "Stealth Ninja Leonardo. MOTU x TMNT: Turtles of Grayskull",
  "Stratos (Cartoon Collection). Masters of the Universe Origins.",
  "Stratos (Vintage Collection). Masters of the Universe. Masterverse",
  "Sun-Man. Masters of the Universe Origins",
  "Teela (Cartoon Collection). Masters of the Universe Origins",
  "Teela (Vintage Collection). Masters of the Universe Masterverse. Mattel",
  "Teela. MOTU x TMNT: Turtles of Grayskull",
  "The Evil Horde: Fright Zone. Masters of the Universe Origins",
  "The Evil Horde: Horde Trooper Prime. Masters of the Universe Origins",
  "ThunderCat Battle Cat. MOTU x Thundercats",
  "Tri-Klops (Cartoon Collection). Masters of the Universe Origins.",
  "Tri-Klops. Masters of the Universe: New Eternia. Masterverse",
  "Triklops. Art Scale 1/10. Masters of the Universe",
  "Tygra. MOTU x Thundercats",
  "Vypor. Masters of the Universe Origins",
  "Whiplash (Cartoon Collection). Masters of the Universe Origins"
]